app/views/admin/albums/show.html.haml

%table{:cellspacing => 0, :border => 0}
  -@album.album_pictures.all.each_slice(3) do |x,y,z|
---
SELECT "album_pictures".* FROM "album_pictures" WHERE ("album_pictures".album_id = 1)