app/controllers/admin/albums_controller.rb

SELECT "albums".* FROM "albums" ORDER BY id desc LIMIT 25 OFFSET 0
---
  def index
    @albums = Album.order('id desc').page params[:page]

INSERT INTO "albums" ("description", "updated_at", "title", "created_at") VALUES ('IN RECOGNITION OF THE CELEBRATION OF THE LEE RIVER SNO RIDERS 25TH ANNIVERSARY THE CLUB WILL BE OFFERING AN ASSORTMENT OF T-SHIRTS & HATS.', '2011-12-22 02:02:22.733396', '25th ANNIVERSARY', '2011-12-22 02:02:22.733396')
---
  def create
    @album = Album.create(params[:album])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 1 LIMIT 1
UPDATE "albums" SET "description" = 'IN RECOGINITION OF THE CELEBRATION OF THE LEE RIVER SNO RIDERS 25TH ANNIVERSARY THE CLUB WILL BE OFFERING AN ASSORTMENT OF T-SHIRTS & HATS.
---
  def update
    @album = Album.find(params[:id])
    if @album.update_attributes(params[:album])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 1 LIMIT 1
DELETE FROM "albums" WHERE "albums"."id" = 1
---
  def destroy
    @album = Album.find(params[:id])
    if @album.destroy