app/controllers/admin/articles_controller.rb

  def index
    @articles = Article.order('id desc')
    @articles = @articles.where(:front_page => true) if ('1' == params[:front_page_only]) || params[:commit].blank?
    @articles = @articles.page params[:page]
---
SELECT "articles".* FROM "articles" ORDER BY id desc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def create
    @article = Article.create(params[:article])
---
INSERT INTO "articles" ("title", "updated_at", "created_by_id", "body", "created_at") VALUES ('President''s Update', '2011-06-25 14:04:17.580794', 1, 'Reminders: Poker derby Saturday February 5th, start time 9:30 - 1:30, finish time by 3:30, you can start at any of the 5 check-points, Alf''s, Anson''s, GG''s, Trapper''s, Tall Timber Lodge, Snowmobile dealer displays, silent auctions at both GG''s & Trappers. Hands 10.00 each or 3 for $20.00

  def update
    @article = Article.find(params[:id])
    if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1
UPDATE "articles" SET "updated_at" = '2011-11-19 14:42:34.184477', "image_file_size" = 31246, "image_file_name" = 'groomer.jpg', "image_content_type" = 'image/jpeg' WHERE "articles"."id" = 1