app/controllers/admin/contact_requests_controller.rb

SELECT "contact_requests".* FROM "contact_requests" ORDER BY id desc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "contact_requests"
---
  def index
    @contact_requests = ContactRequest.order('id desc').page params[:page]

SELECT "contact_requests".* FROM "contact_requests" WHERE "contact_requests"."id" = 1 LIMIT 1
UPDATE "contact_requests" SET "updated_at" = '2011-06-28 23:54:33.479902', "received" = 't' WHERE "contact_requests"."id" = 3
---
  def show
    @contact_request = ContactRequest.find(params[:id])
    @contact_request.update_attribute(:received, true)

SELECT "contact_requests".* FROM "contact_requests" WHERE "contact_requests"."id" = 1 LIMIT 1
DELETE FROM "contact_requests" WHERE "contact_requests"."id" = 1
---
  def destroy
    @contact_request = ContactRequest.find(params[:id])
    if @contact_request.destroy