app/controllers/admin/contact_request_emails_controller.rb

SELECT "contact_request_emails".* FROM "contact_request_emails" WHERE "contact_request_emails"."id" = 2 LIMIT 1
---
  def edit
    @contact_request_email = ContactRequestEmail.find(params[:id])

INSERT INTO "contact_request_emails" ("name", "updated_at", "created_at", "email") VALUES ('Brad Reid', '2011-11-19 19:27:29.586716', '2011-11-19 19:27:29.586716', 'brad@beyondthecube.ca')
---
  def create
    @contact_request_email = ContactRequestEmail.new(params[:contact_request_email])
    if @contact_request_email.save

SELECT "contact_request_emails".* FROM "contact_request_emails" WHERE "contact_request_emails"."id" = 2 LIMIT 1
UPDATE "contact_request_emails" SET "updated_at" = '2011-11-19 18:13:49.799452', "email" = 'bradreid20@gmail.com' WHERE "contact_request_emails"."id" = 2
---
  def update
    @contact_request_email = ContactRequestEmail.find(params[:id])
    if @contact_request_email.update_attributes(params[:contact_request_email])

SELECT "contact_request_emails".* FROM "contact_request_emails" WHERE "contact_request_emails"."id" = 1 LIMIT 1
DELETE FROM "contact_request_emails" WHERE "contact_request_emails"."id" = 1
---
  def destroy
    @contact_request_email = ContactRequestEmail.find(params[:id])
    if @contact_request_email.destroy