app/controllers/admin/events_controller.rb

SELECT "events".* FROM "events"
SELECT "events".* FROM "events" WHERE (start >= '2011-07-01 23:41:57') ORDER BY start asc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "events" WHERE (start >= '2011-06-24 16:56:00')
SELECT "events".* FROM "events" ORDER BY start asc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "events"
---
  def index
    if params['upcomming_events'] == '1' || params[:commit].blank?
      @events = Event.order('start desc').where("start >= ?", Time.now.utc.to_s(:db)).page params[:page]
    else
      @events = Event.order('start desc').page params[:page]

INSERT INTO "events" ("start", "location", "name", "created_at", "updated_at", "details") VALUES ('2011-06-24 15:07:00.000000', 'Club maintentance building', 'General Meeting', '2011-06-24 15:07:34.084174', '2011-06-24 15:07:34.084174', 'testing does this work.
---
  def create
    @event = Event.create(params[:event])

SELECT "events".* FROM "events" WHERE "events"."id" = 3 LIMIT 1
UPDATE "events" SET "updated_at" = '2011-06-26 16:13:06.821375', "start" = '2011-09-03 20:00:00.000000' WHERE "events"."id" = 5
---
  def update
    @event = Event.find(params[:id])
    if @event.update_attributes(params[:event])

SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
DELETE FROM "events" WHERE "events"."id" = 1
---
  def destroy
    @event = Event.find(params[:id])
    if @event.destroy