app/controllers/admin/newsletters_controller.rb

  def index
    @newsletters = Newsletter.order('id desc').page params[:page]
---
SELECT "newsletters".* FROM "newsletters" ORDER BY id desc LIMIT 25 OFFSET 0

  def create
    @newsletter = Newsletter.new(params[:newsletter])
    if @newsletter.save
---
INSERT INTO "newsletters" ("newsletter_updated_at", "newsletter_file_size", "updated_at", "name", "newsletter_content_type", "newsletter_file_name", "created_at") VALUES ('2011-06-29 14:44:32.481763', 386, '2011-06-29 14:44:32.482509', 'Spring 2010', 'image/png', 'btc_favicon.png', '2011-06-29 14:44:32.482509')

  def edit
    @newsletter = Newsletter.find(params[:id])
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = 1 LIMIT 1

  def update
    @newsletter = Newsletter.find(params[:id])
    if @newsletter.update_attributes(params[:newsletter])
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = 1 LIMIT 1
UPDATE "newsletters" SET "newsletter_file_size" = 557722, "newsletter_updated_at" = '2011-06-29 13:47:48.551342', "updated_at" = '2011-06-29 13:47:48.556806', "newsletter_content_type" = 'application/pdf', "newsletter_file_name" = 'About Downloads.pdf' WHERE "newsletters"."id" = 2

  def destroy
    @newsletter = Newsletter.find(params[:id])
    if @newsletter.destroy
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = 1 LIMIT 1
DELETE FROM "newsletters" WHERE "newsletters"."id" = 1