app/controllers/admin/sponsors_controller.rb

SELECT "sponsors".* FROM "sponsors" ORDER BY name asc
---
  def index
    @sponsors = Sponsor.order('name asc')

INSERT INTO "sponsors" ("url", "updated_at", "address", "created_at", "phone_number", "city", "name") VALUES ('http://www.beyondthecube.ca', '2011-07-01 13:46:17.840286', 'test', '2011-07-01 13:46:17.840286', 'adsf', 'test', 'Brad Reid')
---
  def create
    @sponsor = Sponsor.new(params[:sponsor])
    if @sponsor.save

SELECT "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = 1 LIMIT 1
---
  def edit
   @sponsor = Sponsor.find(params[:id])

SELECT "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = 1 LIMIT 1
UPDATE "sponsors" SET "url" = 'http://www.beyondthecube.ca', "updated_at" = '2011-06-30 21:03:59.426031' WHERE "sponsors"."id" = 1
---
  def update
    @sponsor = Sponsor.find(params[:id])
    if @sponsor.update_attributes(params[:sponsor])

SELECT "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = 1 LIMIT 1
DELETE FROM "sponsors" WHERE "sponsors"."id" = 1
---
  def destroy
    @sponsor = Sponsor.find(params[:id])
    if @sponsor.destroy