app/controllers/admin/trail_conditions_controller.rb

  def show
    @trail_condition = TrailCondition.first
---
SELECT "trail_conditions".* FROM "trail_conditions" LIMIT 1

  def edit
    @trail_condition = TrailCondition.first
---
SELECT "trail_conditions".* FROM "trail_conditions" LIMIT 1

  def update
    @trail_condition = TrailCondition.first
    if @trail_condition.update_attributes(params[:trail_condition].merge(:shared => nil, :user_updated_at => Time.now))
---
SELECT "trail_conditions".* FROM "trail_conditions" LIMIT 1
UPDATE "trail_conditions" SET "status" = 'closed', "updated_at" = '2011-06-26 14:02:37.916857' WHERE "trail_conditions"."id" = 1