app/views/welcome/index.html.haml

                High:
                =@weather.forcast.forecasts.first['high']
---
SELECT "forcasts".* FROM "forcasts" ORDER BY forcasts.id DESC LIMIT 1