app/controllers/admin/albums/album_pictures_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 1 LIMIT 1
INSERT INTO "album_pictures" ("image_content_type", "album_id", "updated_at", "image_file_name", "title", "created_at", "image_file_size") VALUES ('image/gif', 1, '2011-11-27 15:07:35.796599', 'handSignals_slowing.gif', NULL, '2011-11-27 15:07:35.796599', 2342)
---
  def create
    @album = Album.find(params[:album_id])
    @picture = @album.album_pictures.build(params[:album_picture])
    if @picture.save

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 1 LIMIT 1
SELECT "album_pictures".* FROM "album_pictures" WHERE "album_pictures"."id" = 4 AND ("album_pictures".album_id = 1) LIMIT 1
DELETE FROM "album_pictures" WHERE "album_pictures"."id" = 1
---
  def destroy
    @album = Album.find(params[:album_id])
    @picture = @album.album_pictures.find(params[:id])
    if @picture.destroy