app/views/albums/index.html.haml

        %td
          =link_to(image_tag(a.album_pictures.first.image(:medium), :width => 100), album_path(a))
---
SELECT "album_pictures".* FROM "album_pictures" WHERE ("album_pictures".album_id = 6) LIMIT 1
SELECT "albums".* FROM "albums" ORDER BY id desc LIMIT 25 OFFSET 0