app/views/admin/trail_conditions/_form.html.haml

      = form.label :status
      = form.select :status, TrailCondition::STATUSES.map{|x| [x.humanize, x]}
---
SELECT "trail_conditions".* FROM "trail_conditions" LIMIT 1