app/controllers/admin_controller.rb

  def load_new_contact_requests
    flash.now[:warn] = nil
    @new_contact_requests = ContactRequest.where({:received => false})
    if @new_contact_requests.size > 0
---
SELECT "contact_requests".* FROM "contact_requests" WHERE "contact_requests"."received" = 'f'
SELECT COUNT(*) FROM "contact_requests" WHERE "contact_requests"."received" = 'f'