app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" ORDER BY id desc LIMIT 25 OFFSET 0
---
  def index
    @albums = Album.order('id desc').page params[:page]