app/controllers/contact_requests_controller.rb

  def create
    @contact_request = ContactRequest.new(params[:contact_request])
    if @contact_request.save
---
INSERT INTO "contact_requests" ("message", "received", "created_at", "subject", "email", "updated_at", "name") VALUES ('test', 'f', '2011-07-01 18:31:46.929208', 'test the contact system', 'bradreid20@gmail.com', '2011-07-01 18:31:46.929208', 'Brad Reid')