app/controllers/newsletters_controller.rb

  def index
    @newsletters = Newsletter.order('id desc').page params[:page]
---
SELECT "newsletters".* FROM "newsletters" ORDER BY id desc LIMIT 25 OFFSET 0