app/controllers/sponsors_controller.rb

  def index
    @sponsors = Sponsor.order('name asc')
---
SELECT "sponsors".* FROM "sponsors" ORDER BY name asc