app/controllers/trail_conditions_controller.rb

  def show
    @trail_condition = TrailCondition.first
---
SELECT "trail_conditions".* FROM "trail_conditions" LIMIT 1