app/controllers/welcome_controller.rb

  def index
    @events = Event.upcomming
    @article = Article.last
    @trail_condition = TrailCondition.club_trails
    @newsletter = Newsletter.last
    @weather = Forcast.latest
---
SELECT "articles".* FROM "articles" ORDER BY articles.id DESC LIMIT 1
SELECT "newsletters".* FROM "newsletters" ORDER BY newsletters.id DESC LIMIT 1
SELECT "forcasts".* FROM "forcasts" ORDER BY forcasts.id DESC LIMIT 1